-- =========================================================
-- 1) select database car_used_db
-- =========================================================
USE used_car_db;

-- =========================================================
-- 2) insert data for makers table
-- =========================================================
INSERT
  INTO makers (maker_name, maker_origin)
VALUES
-- 국산차
('현대', 1),
('제네시스', 1),
('기아', 1),
('쉐보레/대우', 1),
('르노코리아(삼성)', 1),
('KG모빌리티(쌍용)', 1),
('어울림모터스', 1),
('기타 국산차', 1),
-- 외제차
('벤츠', 0),
('포르쉐', 0),
('BMW', 0),
('페라리', 0),
('롤스로이스', 0),
('벤틀리', 0),
('람보르기니', 0),
('아우디', 0),
('폭스바겐', 0),
('렉서스', 0),
('미니', 0),
('BYD', 0),
('DS', 0),
('GMC', 0),
('닛산', 0),
('다이하쓰', 0),
('닷지', 0),
('동펑', 0),
('란치아', 0),
('랜드로버', 0),
('로버', 0),
('로터스', 0),
('르노', 0),
('링컨', 0),
('마이바흐', 0),
('마세라티', 0),
('마쯔다', 0),
('맥라렌', 0),
('머큐리', 0),
('모건', 0),
('미쓰비시', 0),
('미쯔오카', 0),
('볼보', 0),
('북기은상', 0),
('부가티', 0),
('뷰익', 0),
('비이스만', 0),
('사브', 0),
('선롱', 0),
('새턴', 0),
('스마트', 0),
('쉐보레', 0),
('스바루', 0),
('스즈키', 0),
('스카니아', 0),
('스파이커', 0),
('시트로엥', 0),
('알파로메오', 0),
('알핀', 0),
('애스턴마틴', 0),
('어큐라', 0),
('오펠', 0),
('오스틴', 0),
('올즈모빌', 0),
('웨스트필드', 0),
('이네오스', 0),
('이베코', 0),
('이스즈', 0),
('인피니티', 0),
('재규어', 0),
('지프', 0),
('캐딜락', 0),
('코닉세크', 0),
('크라이슬러', 0),
('테슬라', 0),
('토요타', 0),
('파가니', 0),
('포드', 0),
('포톤', 0),
('폰티악', 0),
('폴스타', 0),
('푸조', 0),
('피스커', 0),
('피아트', 0),
('허머', 0),
('혼다', 0),
('홀덴', 0),
('히노', 0),
('기타 수입차', 0);

-- =========================================================
-- 3) check inserted data
-- =========================================================

-- 1) check table rows count
SELECT
    COUNT( * ) AS total_rows
  FROM makers;

-- 2) check table rows count for group origin
SELECT
    maker_origin AS '제조사 국적'
  , COUNT( * )   AS count
  FROM makers
 GROUP BY maker_origin;

-- 3) check sample data 10 rows
SELECT
    maker_id
  , maker_name
  , maker_origin
  FROM makers
 ORDER BY maker_id
 LIMIT 10;

-- 4) check maker_origin mapping (현대=1, 벤츠=0)
SELECT
    maker_id
  , maker_name
  , CASE maker_origin
        WHEN 1
            THEN '국산'
        WHEN 0
            THEN '수입'
        END AS maker_origin_desc
  FROM makers
 WHERE maker_name IN ('현대', '벤츠');

-- ============================================================================
-- 3) Commit: apply schema changes (tables, foreign keys, constraints, indexes)
-- ============================================================================

COMMIT;